MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ16GS504/mcu.h
#define _ADCPC0_TRGSRC0_POSITION                 0x00000000
#define _ADCPC0_TRGSRC0_MASK                     0x0000001F
#define _ADCPC0_TRGSRC0_LENGTH                   0x00000005

#define _ADCPC0_SWTRG0_POSITION                  0x00000005
#define _ADCPC0_SWTRG0_MASK                      0x00000020
#define _ADCPC0_SWTRG0_LENGTH                    0x00000001

#define _ADCPC0_PEND0_POSITION                   0x00000006
#define _ADCPC0_PEND0_MASK                       0x00000040
#define _ADCPC0_PEND0_LENGTH                     0x00000001

#define _ADCPC0_IRQEN0_POSITION                  0x00000007
#define _ADCPC0_IRQEN0_MASK                      0x00000080
#define _ADCPC0_IRQEN0_LENGTH                    0x00000001

#define _ADCPC0_TRGSRC1_POSITION                 0x00000008
#define _ADCPC0_TRGSRC1_MASK                     0x00001F00
#define _ADCPC0_TRGSRC1_LENGTH                   0x00000005

#define _ADCPC0_SWTRG1_POSITION                  0x0000000D
#define _ADCPC0_SWTRG1_MASK                      0x00002000
#define _ADCPC0_SWTRG1_LENGTH                    0x00000001

#define _ADCPC0_PEND1_POSITION                   0x0000000E
#define _ADCPC0_PEND1_MASK                       0x00004000
#define _ADCPC0_PEND1_LENGTH                     0x00000001

#define _ADCPC0_IRQEN1_POSITION                  0x0000000F
#define _ADCPC0_IRQEN1_MASK                      0x00008000
#define _ADCPC0_IRQEN1_LENGTH                    0x00000001

#define _ADCPC0_TRGSRC00_POSITION                0x00000000
#define _ADCPC0_TRGSRC00_MASK                    0x00000001
#define _ADCPC0_TRGSRC00_LENGTH                  0x00000001

#define _ADCPC0_TRGSRC01_POSITION                0x00000001
#define _ADCPC0_TRGSRC01_MASK                    0x00000002
#define _ADCPC0_TRGSRC01_LENGTH                  0x00000001

#define _ADCPC0_TRGSRC02_POSITION                0x00000002
#define _ADCPC0_TRGSRC02_MASK                    0x00000004
#define _ADCPC0_TRGSRC02_LENGTH                  0x00000001

#define _ADCPC0_TRGSRC03_POSITION                0x00000003
#define _ADCPC0_TRGSRC03_MASK                    0x00000008
#define _ADCPC0_TRGSRC03_LENGTH                  0x00000001

#define _ADCPC0_TRGSRC04_POSITION                0x00000004
#define _ADCPC0_TRGSRC04_MASK                    0x00000010
#define _ADCPC0_TRGSRC04_LENGTH                  0x00000001

#define _ADCPC0_TRGSRC10_POSITION                0x00000008
#define _ADCPC0_TRGSRC10_MASK                    0x00000100
#define _ADCPC0_TRGSRC10_LENGTH                  0x00000001

#define _ADCPC0_TRGSRC11_POSITION                0x00000009
#define _ADCPC0_TRGSRC11_MASK                    0x00000200
#define _ADCPC0_TRGSRC11_LENGTH                  0x00000001

#define _ADCPC0_TRGSRC12_POSITION                0x0000000A
#define _ADCPC0_TRGSRC12_MASK                    0x00000400
#define _ADCPC0_TRGSRC12_LENGTH                  0x00000001

#define _ADCPC0_TRGSRC13_POSITION                0x0000000B
#define _ADCPC0_TRGSRC13_MASK                    0x00000800
#define _ADCPC0_TRGSRC13_LENGTH                  0x00000001

#define _ADCPC0_TRGSRC14_POSITION                0x0000000C
#define _ADCPC0_TRGSRC14_MASK                    0x00001000
#define _ADCPC0_TRGSRC14_LENGTH                  0x00000001

#define _ADCPC1_TRGSRC2_POSITION                 0x00000000
#define _ADCPC1_TRGSRC2_MASK                     0x0000001F
#define _ADCPC1_TRGSRC2_LENGTH                   0x00000005

#define _ADCPC1_SWTRG2_POSITION                  0x00000005
#define _ADCPC1_SWTRG2_MASK                      0x00000020
#define _ADCPC1_SWTRG2_LENGTH                    0x00000001

#define _ADCPC1_PEND2_POSITION                   0x00000006
#define _ADCPC1_PEND2_MASK                       0x00000040
#define _ADCPC1_PEND2_LENGTH                     0x00000001

#define _ADCPC1_IRQEN2_POSITION                  0x00000007
#define _ADCPC1_IRQEN2_MASK                      0x00000080
#define _ADCPC1_IRQEN2_LENGTH                    0x00000001

#define _ADCPC1_TRGSRC3_POSITION                 0x00000008
#define _ADCPC1_TRGSRC3_MASK                     0x00001F00
#define _ADCPC1_TRGSRC3_LENGTH                   0x00000005

#define _ADCPC1_SWTRG3_POSITION                  0x0000000D
#define _ADCPC1_SWTRG3_MASK                      0x00002000
#define _ADCPC1_SWTRG3_LENGTH                    0x00000001

#define _ADCPC1_PEND3_POSITION                   0x0000000E
#define _ADCPC1_PEND3_MASK                       0x00004000
#define _ADCPC1_PEND3_LENGTH                     0x00000001

#define _ADCPC1_IRQEN3_POSITION                  0x0000000F
#define _ADCPC1_IRQEN3_MASK                      0x00008000
#define _ADCPC1_IRQEN3_LENGTH                    0x00000001

#define _ADCPC1_TRGSRC20_POSITION                0x00000000
#define _ADCPC1_TRGSRC20_MASK                    0x00000001
#define _ADCPC1_TRGSRC20_LENGTH                  0x00000001

#define _ADCPC1_TRGSRC21_POSITION                0x00000001
#define _ADCPC1_TRGSRC21_MASK                    0x00000002
#define _ADCPC1_TRGSRC21_LENGTH                  0x00000001

#define _ADCPC1_TRGSRC22_POSITION                0x00000002
#define _ADCPC1_TRGSRC22_MASK                    0x00000004
#define _ADCPC1_TRGSRC22_LENGTH                  0x00000001

#define _ADCPC1_TRGSRC23_POSITION                0x00000003
#define _ADCPC1_TRGSRC23_MASK                    0x00000008
#define _ADCPC1_TRGSRC23_LENGTH                  0x00000001

#define _ADCPC1_TRGSRC24_POSITION                0x00000004
#define _ADCPC1_TRGSRC24_MASK                    0x00000010
#define _ADCPC1_TRGSRC24_LENGTH                  0x00000001

#define _ADCPC1_TRGSRC30_POSITION                0x00000008
#define _ADCPC1_TRGSRC30_MASK                    0x00000100
#define _ADCPC1_TRGSRC30_LENGTH                  0x00000001

#define _ADCPC1_TRGSRC31_POSITION                0x00000009
#define _ADCPC1_TRGSRC31_MASK                    0x00000200
#define _ADCPC1_TRGSRC31_LENGTH                  0x00000001

#define _ADCPC1_TRGSRC32_POSITION                0x0000000A
#define _ADCPC1_TRGSRC32_MASK                    0x00000400
#define _ADCPC1_TRGSRC32_LENGTH                  0x00000001

#define _ADCPC1_TRGSRC33_POSITION                0x0000000B
#define _ADCPC1_TRGSRC33_MASK                    0x00000800
#define _ADCPC1_TRGSRC33_LENGTH                  0x00000001

