MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ16GS504/mcu.h
#define _RPINR33_SYNCI1R1_POSITION               0x00000009
#define _RPINR33_SYNCI1R1_MASK                   0x00000200
#define _RPINR33_SYNCI1R1_LENGTH                 0x00000001

#define _RPINR33_SYNCI1R2_POSITION               0x0000000A
#define _RPINR33_SYNCI1R2_MASK                   0x00000400
#define _RPINR33_SYNCI1R2_LENGTH                 0x00000001

#define _RPINR33_SYNCI1R3_POSITION               0x0000000B
#define _RPINR33_SYNCI1R3_MASK                   0x00000800
#define _RPINR33_SYNCI1R3_LENGTH                 0x00000001

#define _RPINR33_SYNCI1R4_POSITION               0x0000000C
#define _RPINR33_SYNCI1R4_MASK                   0x00001000
#define _RPINR33_SYNCI1R4_LENGTH                 0x00000001

#define _RPINR33_SYNCI1R5_POSITION               0x0000000D
#define _RPINR33_SYNCI1R5_MASK                   0x00002000
#define _RPINR33_SYNCI1R5_LENGTH                 0x00000001

#define _RPINR34_SYNCI2R_POSITION                0x00000000
#define _RPINR34_SYNCI2R_MASK                    0x0000003F
#define _RPINR34_SYNCI2R_LENGTH                  0x00000006

#define _RPINR34_SYNCI2R0_POSITION               0x00000000
#define _RPINR34_SYNCI2R0_MASK                   0x00000001
#define _RPINR34_SYNCI2R0_LENGTH                 0x00000001

#define _RPINR34_SYNCI2R1_POSITION               0x00000001
#define _RPINR34_SYNCI2R1_MASK                   0x00000002
#define _RPINR34_SYNCI2R1_LENGTH                 0x00000001

#define _RPINR34_SYNCI2R2_POSITION               0x00000002
#define _RPINR34_SYNCI2R2_MASK                   0x00000004
#define _RPINR34_SYNCI2R2_LENGTH                 0x00000001

#define _RPINR34_SYNCI2R3_POSITION               0x00000003
#define _RPINR34_SYNCI2R3_MASK                   0x00000008
#define _RPINR34_SYNCI2R3_LENGTH                 0x00000001

#define _RPINR34_SYNCI2R4_POSITION               0x00000004
#define _RPINR34_SYNCI2R4_MASK                   0x00000010
#define _RPINR34_SYNCI2R4_LENGTH                 0x00000001

#define _RPINR34_SYNCI2R5_POSITION               0x00000005
#define _RPINR34_SYNCI2R5_MASK                   0x00000020
#define _RPINR34_SYNCI2R5_LENGTH                 0x00000001

#define _RPOR0_RP0R_POSITION                     0x00000000
#define _RPOR0_RP0R_MASK                         0x0000003F
#define _RPOR0_RP0R_LENGTH                       0x00000006

#define _RPOR0_RP1R_POSITION                     0x00000008
#define _RPOR0_RP1R_MASK                         0x00003F00
#define _RPOR0_RP1R_LENGTH                       0x00000006

#define _RPOR0_RP0R0_POSITION                    0x00000000
#define _RPOR0_RP0R0_MASK                        0x00000001
#define _RPOR0_RP0R0_LENGTH                      0x00000001

#define _RPOR0_RP0R1_POSITION                    0x00000001
#define _RPOR0_RP0R1_MASK                        0x00000002
#define _RPOR0_RP0R1_LENGTH                      0x00000001

#define _RPOR0_RP0R2_POSITION                    0x00000002
#define _RPOR0_RP0R2_MASK                        0x00000004
#define _RPOR0_RP0R2_LENGTH                      0x00000001

#define _RPOR0_RP0R3_POSITION                    0x00000003
#define _RPOR0_RP0R3_MASK                        0x00000008
#define _RPOR0_RP0R3_LENGTH                      0x00000001

#define _RPOR0_RP0R4_POSITION                    0x00000004
#define _RPOR0_RP0R4_MASK                        0x00000010
#define _RPOR0_RP0R4_LENGTH                      0x00000001

#define _RPOR0_RP0R5_POSITION                    0x00000005
#define _RPOR0_RP0R5_MASK                        0x00000020
#define _RPOR0_RP0R5_LENGTH                      0x00000001

#define _RPOR0_RP1R0_POSITION                    0x00000008
#define _RPOR0_RP1R0_MASK                        0x00000100
#define _RPOR0_RP1R0_LENGTH                      0x00000001

#define _RPOR0_RP1R1_POSITION                    0x00000009
#define _RPOR0_RP1R1_MASK                        0x00000200
#define _RPOR0_RP1R1_LENGTH                      0x00000001

#define _RPOR0_RP1R2_POSITION                    0x0000000A
#define _RPOR0_RP1R2_MASK                        0x00000400
#define _RPOR0_RP1R2_LENGTH                      0x00000001

#define _RPOR0_RP1R3_POSITION                    0x0000000B
#define _RPOR0_RP1R3_MASK                        0x00000800
#define _RPOR0_RP1R3_LENGTH                      0x00000001

#define _RPOR0_RP1R4_POSITION                    0x0000000C
#define _RPOR0_RP1R4_MASK                        0x00001000
#define _RPOR0_RP1R4_LENGTH                      0x00000001

#define _RPOR0_RP1R5_POSITION                    0x0000000D
#define _RPOR0_RP1R5_MASK                        0x00002000
#define _RPOR0_RP1R5_LENGTH                      0x00000001

#define _RPOR1_RP2R_POSITION                     0x00000000
#define _RPOR1_RP2R_MASK                         0x0000003F
#define _RPOR1_RP2R_LENGTH                       0x00000006

#define _RPOR1_RP3R_POSITION                     0x00000008
#define _RPOR1_RP3R_MASK                         0x00003F00
#define _RPOR1_RP3R_LENGTH                       0x00000006

#define _RPOR1_RP2R0_POSITION                    0x00000000
#define _RPOR1_RP2R0_MASK                        0x00000001
#define _RPOR1_RP2R0_LENGTH                      0x00000001

#define _RPOR1_RP2R1_POSITION                    0x00000001
#define _RPOR1_RP2R1_MASK                        0x00000002
#define _RPOR1_RP2R1_LENGTH                      0x00000001

#define _RPOR1_RP2R2_POSITION                    0x00000002
#define _RPOR1_RP2R2_MASK                        0x00000004
#define _RPOR1_RP2R2_LENGTH                      0x00000001

#define _RPOR1_RP2R3_POSITION                    0x00000003
#define _RPOR1_RP2R3_MASK                        0x00000008
#define _RPOR1_RP2R3_LENGTH                      0x00000001

#define _RPOR1_RP2R4_POSITION                    0x00000004
#define _RPOR1_RP2R4_MASK                        0x00000010
#define _RPOR1_RP2R4_LENGTH                      0x00000001

#define _RPOR1_RP2R5_POSITION                    0x00000005
#define _RPOR1_RP2R5_MASK                        0x00000020
#define _RPOR1_RP2R5_LENGTH                      0x00000001

#define _RPOR1_RP3R0_POSITION                    0x00000008
#define _RPOR1_RP3R0_MASK                        0x00000100
#define _RPOR1_RP3R0_LENGTH                      0x00000001

